# language: ru
Функция: Расчет стоимости заказа в кафе
  Сценарий: Фабричный метод создает кофе
    Допустим кафе создало кофе
    Когда рассчитана стоимость заказа
    Тогда к оплате 150 рублей

  Сценарий: Декоратор добавляет молоко
    Допустим кафе создало кофе
    И к напитку добавлено молоко
    Когда рассчитана стоимость заказа
    Тогда к оплате 180 рублей

  Сценарий: Стратегия применяет скидку студента
    Допустим кафе создало кофе
    И к напитку добавлено молоко
    И выбрана скидка студента
    Когда рассчитана стоимость заказа
    Тогда к оплате 162 рублей
